group_name = " พวกเรากลุ่มSeekers "
print(group_name)
explain = "เป็นเครื่องมือในการวัดผลการประเมินพนักงานในบริษัท ทั้ง 8 คน โดยใช้เกณฑ์การประเมินโดยใช้ค่าเฉลี่ยทั้ง 3 ด้านทักษะของแต่ละบุคคล"
print(explain)

def get_score(message): # สร้างฟังก์ชันชื่อ get_score รับข้อความมาแสดงตอนให้กรอก
    while True: # วนลูปไปเรื่อย ๆ จนกว่าจะได้ค่าที่ถูกต้อง
        try:   # ทดลองรันโค้ดที่อาจเกิดข้อผิดพลาด
            score =float(input(message))   # รับค่าจากผู้ใช้เป็นตัวเลข

            if score < 0 or score > 10:  # ตรวจว่าคะแนนอยู่นอกช่วง 0-10 หรือป่าวววว
                print("กรุณากรอกคะแนนระหว่าง 0 ถึง 10 ")  # แจ้งเตือนให้กรอกใหม่
            else:
                return score # ถ้าค่าถูกต้อง ส่งค่ากลับและหยุดลูป

        except ValueError:  # ถ้าที่ใส่เป็นตัวอื่น หรือก็คือตัวอักษร ก็จะให้แสดง กรอกเป็นตัวเลข
            print("กรุณากรอกเป็นตัวเลขเท่านั้น") # แสดงกรอกเป็นตัวเลข

employees = []  # สร้าง list เก็บข้อมูลพนักงาน
for i in range(8): # วนลูป 8 รอบเพื่อรับข้อมูลพนักงาน 8 คน
    print(f"กรอกข้อมูลพนักงานคนที่ {i+1} ")  # แสดงลำดับพนักงาน
    name = input("ชื่อ : ") # รับชื่อพนักงาน
    performance = get_score("คะแนนผลงาน _/10: ")   # รับคะแนนผลงาน
    responsibility = get_score("คะแนนความรับผิดชอบ _/10: ") # รับคะแนนผลงาน
    teamwork = get_score("คะแนนการทำงานเป็นทีม _/10: ") # รับคะแนนผลงาน

    employees.append([name, performance, responsibility, teamwork]) # เพิ่มข้อมูลพนักงานลงใน list employees

results = {} # สร้าง dictionary ว่างสำหรับเก็บผลการประเมิน

for emp in employees:  # วนอ่านข้อมูลพนักงานทีละคนจาก list
    name = emp[0] # ดึงชื่อพนักงาน
    avg = (emp[1] + emp[2] + emp[3]) / 3# คำนวณค่าเฉลี่ยของคะแนนทั้ง 3 

    if avg >= 8: # ถ้าค่าเฉลี่ยตั้งแต่ 8 ขึ้นไป แสดง"ดีเยี่ยม"
        status = "ดีเยี่ยม"
    elif avg >= 6:  # ถ้าค่าเฉลี่ยตั้งแต่ 6 ขึ้นไป แสดง"ผ่าน"
        status = "ผ่าน"
    else:             # ถ้าค่าเฉลี่ยที่ไม่ใช่เลย แสดง"ต้องปรับปรุง"
        status = "ต้องปรับปรุง"
    results[name] = {  # ใช้ชื่อพนักงานเป็น key
        "average_score": avg,    # เก็บค่าเฉลี่ยคะแนน
        "status": status  # เก็บผลการประเมิน
    }

print("ผลการประเมินพนักงาน")  # แสดงหัวข้อผลลัพธ์
for name, info in results.items():   # วนลูปอ่านข้อมูลใน dictionary
    print(name, "ค่าเฉลี่ย:", round(info["average_score"], 2), "ระดับ:", info["status"])  # แสดงชื่อ ค่าเฉลี่ย และใช้ roundปัดทศนิยม 2 ตำแหน่ง
print("จำนวนพนักงานทั้งหมดในระบบ =", len(results)) # ใช้ len() นับจำนวนพนักงานที่ถูกเก็บใน dictionary